p2p-bench/results/run5/scenarios/simple_p2p_on-c1/run_1.stdout.txt
WARNING 06-27 02:33:54 [cuda.py:838] Detected different devices in the system: NVIDIA GeForce RTX 5070, NVIDIA GeForce RTX 5060 Ti, NVIDIA GeForce RTX 5060 Ti, NVIDIA GeForce RTX 5060 Ti, NVIDIA GeForce RTX 5060 Ti. Please make sure to set `CUDA_DEVICE_ORDER=PCI_BUS_ID` to avoid unexpected behavior.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x706ecc300360>, trust_remote_code=False, seed=1234, num_prompts=16, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=4096, random_output_len=2048, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='vllm', base_url='http://127.0.0.1:8080', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=1, model='simple_p2p_on-c1', input_len=None, output_len=None, tokenizer='/data/models/Qwen/Qwen3.6-27B-FP8', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=8, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='results/run5/scenarios/simple_p2p_on-c1', result_filename='run_1.json', ignore_eos=True, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,99', goodput=None, request_id_prefix='bench-af06c7b7-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 06-27 02:33:58 [utils.py:90] Sampling input_len from [4096, 4096] and output_len from [2048, 2048]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 8 requests...
Warmup run completed.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 1
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     16        
Failed requests:                         0         
Maximum request concurrency:             1         
Benchmark duration (s):                  558.58    
Total input tokens:                      65536     
Total generated tokens:                  32768     
Request throughput (req/s):              0.03      
Output token throughput (tok/s):         58.66     
Peak output token throughput (tok/s):    25.00     
Peak concurrent requests:                2.00      
Total token throughput (tok/s):          175.99    
---------------Time to First Token----------------
Mean TTFT (ms):                          6117.98   
Median TTFT (ms):                        6122.76   
P50 TTFT (ms):                           6122.76   
P90 TTFT (ms):                           7580.34   
P99 TTFT (ms):                           7585.81   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          14.06     
Median TPOT (ms):                        14.01     
P50 TPOT (ms):                           14.01     
P90 TPOT (ms):                           16.51     
P99 TPOT (ms):                           21.20     
---------------Inter-token Latency----------------
Mean ITL (ms):                           41.81     
Median ITL (ms):                         41.79     
P50 ITL (ms):                            41.79     
P90 ITL (ms):                            42.02     
P99 ITL (ms):                            42.74     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          34901.68  
Median E2EL (ms):                        33889.16  
P50 E2EL (ms):                           33889.16  
P90 E2EL (ms):                           41237.49  
P99 E2EL (ms):                           50975.81  
==================================================


  0%|          | 0/8 [00:00<?, ?it/s]
 12%|█▎        | 1/8 [00:26<03:08, 27.00s/it]
 25%|██▌       | 2/8 [00:54<02:42, 27.11s/it]
 38%|███▊      | 3/8 [01:21<02:14, 26.98s/it]
 50%|█████     | 4/8 [01:47<01:47, 26.75s/it]
 62%|██████▎   | 5/8 [02:14<01:20, 26.74s/it]
 75%|███████▌  | 6/8 [02:42<00:54, 27.40s/it]
 88%|████████▊ | 7/8 [03:10<00:27, 27.51s/it]
100%|██████████| 8/8 [03:40<00:00, 28.35s/it]
100%|██████████| 8/8 [03:40<00:00, 27.59s/it]

  0%|          | 0/16 [00:00<?, ?it/s]
  6%|▋         | 1/16 [00:26<06:35, 26.34s/it]
 12%|█▎        | 2/16 [00:55<06:35, 28.25s/it]
 19%|█▉        | 3/16 [01:30<06:43, 31.02s/it]
 25%|██▌       | 4/16 [02:03<06:23, 31.99s/it]
 31%|███▏      | 5/16 [02:32<05:37, 30.72s/it]
 38%|███▊      | 6/16 [03:08<05:25, 32.51s/it]
 44%|████▍     | 7/16 [03:38<04:47, 31.94s/it]
 50%|█████     | 8/16 [04:12<04:18, 32.34s/it]
 56%|█████▋    | 9/16 [04:50<04:00, 34.31s/it]
 62%|██████▎   | 10/16 [05:42<03:59, 39.84s/it]
 69%|██████▉   | 11/16 [06:17<03:10, 38.16s/it]
 75%|███████▌  | 12/16 [06:55<02:33, 38.28s/it]
 81%|████████▏ | 13/16 [07:26<01:47, 35.93s/it]
 88%|████████▊ | 14/16 [07:57<01:09, 34.52s/it]
 94%|█████████▍| 15/16 [08:41<00:37, 37.34s/it]
100%|██████████| 16/16 [09:18<00:00, 37.24s/it]
100%|██████████| 16/16 [09:18<00:00, 34.91s/it]